{"architectures": ["LLaDA2MoeModelLM"], "auto_map": {"AutoConfig": "configuration_llada2_moe.LLaDA2MoeConfig", "AutoModel": "modeling_llada2_moe.LLaDA2MoeModel", "AutoModelForCausalLM": "modeling_llada2_moe.LLaDA2MoeModelLM"}, "model_type": "llada2_moe", "num_hidden_layers": 1, "hidden_size": 64, "intermediate_size": 128, "num_experts": 2, "num_experts_per_tok": 1, "num_attention_heads": 2, "num_key_value_heads": 1, "moe_intermediate_size": 64, "vocab_size": 157184, "hidden_act": "silu", "head_dim": 32, "num_shared_experts": 1, "max_position_embeddings": 512, "rms_norm_eps": 1e-06, "tie_word_embeddings": false, "rope_theta": 600000, "partial_rotary_factor": 0.5, "rotary_dim": 16, "n_group": 1, "topk_group": 1, "norm_topk_prob": true, "router_dtype": "fp32", "score_function": "sigmoid", "moe_router_enable_expert_bias": true, "routed_scaling_factor": 1.0}